{"sections":[{"number":1,"content":"Document Search in .NET with Kernel Memory - DEV Community\n    \n    \n    \n    \n    \n\n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n    \n      \n      \n\n      \n      \n      \n      \n      \n\n\n\n      \n\n\n\n\n\n        \n      \n      \n      \n      \n      \n      \n      \n      \n      \n      \n      \n      \n      \n\n      \n      \n      \n    \n  \n      \n        \n        \n\n        \n\n\n\n        \n          \n        \n        \n          \n        \n            \n  \n    \n      \n        \n      \n        \n          \n            \n              Forem Feed\n            \n            \n              Follow new Subforems to improve your feed\n            \n          \n          \n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            DEV Community\n          \n          Follow\n          \n            A space to discuss and keep up software development and manage your software career\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Future\n          \n          Follow\n          \n            News and discussion of science and technology such as AI, VR, cryptocurrency, quantum computing, and more.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Open Forem\n          \n          Follow\n          \n            A general discussion space for the Forem community. If it doesn\u0026#39;t have a home elsewhere, it belongs here\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Gamers Forem\n          \n          Follow\n          \n            An inclusive community for gaming enthusiasts\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Music Forem\n          \n          Follow\n          \n            From composing and gigging to gear, hot music takes, and everything in between.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Vibe Coding Forem\n          \n          Follow\n          \n            Discussing AI software development, and showing off what we\u0026#39;re building.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Popcorn Movies and TV\n          \n          Follow\n          \n            Movie and TV enthusiasm, criticism and everything in-between.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            DUMB DEV Community\n          \n          Follow\n          \n            Memes and software development shitposting\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Design Community\n          \n          Follow\n          \n            Web design, graphic design and everything in-between\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Security Forem\n          \n          Follow\n          \n            Your central hub for all things security. From ethical hacking and CTFs to GRC and career development, for beginners and pros alike\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Golf Forem\n          \n          Follow\n          \n            A community of golfers and golfing enthusiasts\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Crypto Forem\n          \n          Follow\n          \n            A collaborative community for all things Crypto—from Bitcoin to protocol development and DeFi to NFTs and market analysis.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Forem Core\n          \n          Follow\n          \n            Discussing the core forem open source software project — features, bugs, performance, self-hosting.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Parenting\n          \n          Follow\n          \n            A place for parents to the share the joys, challenges, and wisdom that come from raising kids. We\u0026#39;re here for them and for each other.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            Maker Forem\n          \n          Follow\n          \n            A community for makers, hobbyists, and professionals to discuss Arduino, Raspberry Pi, 3D printing, and much more.\n          \n        \n    \n    \n      \n        \n      \n        \n          \n            \n          \n          \n            HMPL.js Forem\n          \n          Follow\n          \n            For developers using HMPL.js to build fast, lightweight web apps. A space to share projects, ask questions, and discuss server-driven templating\n          \n        \n    \n  \n  \n    Dropdown menu\n    \n\n\n  \n  \n    Dropdown menu\n    \n\n\n  \n\n\n\n\n\n\n\n\n        \n\n\n  \n  Skip to content\n  \n    \n      \n        Navigation menu\n    \n\n\n      \n    \n    \n    \n\n\n\n    \n      \n        \n          \n            \n            \n              Search\n    \n\n\n            \n\n            \n                Powered by Algolia\n                Search\n  \n\n\n            \n          \n        \n      \n    \n\n    \n        \n          \n            \n              Log in\n            \n          \n\n          \n            Create account\n          \n        \n    \n  \n\n\n\n  \n    \n      DEV Community\n\n      \n        Close\n\n      \n    \n\n    \n    \n  \n  \n\n\n\n        \n\n  \n    \n\n    \n\n\n\n\n\n\n  \n\n\n\n  \n\n  \n  \n    \n      \n  \n\n    \n\n  \n      \n        \n    \n        \n    \n    \n        \n        \n        \n    \n\n\n      \n      \n        \n      \n      \n        \n      \n      \n        Add reaction\n      \n  \n\n  \n    \n        \n    \n      \n    \n    \n\n    \n      Like\n    \n\n\n        \n    \n      \n    \n    \n\n    \n      Unicorn\n    \n\n\n        \n    \n      \n    \n    \n\n    \n      Exploding Head\n    \n\n\n        \n    \n      \n    \n    \n\n    \n      Raised Hands\n    \n\n\n        \n    \n      \n    \n    \n\n    \n      Fire\n    \n\n\n    \n  \n\n\n\n    \n      \n    \n\n\n    \n    \n      \n    \n\n    \n      Jump to Comments\n    \n\n\n\n    \n      \n    \n\n\n    \n    \n\n    \n      Save\n    \n\n\n\n\n    \n      \n  \n\n\n    \n    \n      Boost\n    \n\n\n\n    \n      \n      \n    \n    \n      \n        More...\n\n      \n\n      \n        \n          \n            Copy link\n            Copy link\n    \n\n\n          \n          Copied to Clipboard\n        \n\n        \n          \n            Share to X\n          \n          \n            Share to LinkedIn\n          \n          \n            Share to Facebook\n          \n          \n            Share to Mastodon\n          \n        \n\n        \n        \n        \n          Share Post via...\n        \n\n        Report Abuse\n      \n    \n  \n\n\n    \n\n    \n      \n\n\n        \n          \n          \n              \n                \n              \n\n            \n              \n                \n                \n                  \n                      \n                      \n                        \n                      \n                  \n                  \n                    Matt Eland\n                    \n                       for Leading EDJE\n                    \n                        Posted on May 20\n\n                        \u0026bull; Edited on May 23\n\n                        \u0026bull; Originally published at blog.leadingedje.com \n                    \n                  \n                \n              \n\n              \n    \n      \n      \u0026nbsp;\n    \n    \n      \n      \u0026nbsp;\n    \n    \n      \n      \u0026nbsp;\n    \n    \n      \n      \u0026nbsp;\n    \n    \n      \n      \u0026nbsp;\n    \n\n\n\n              \n                Document Search in .NET with Kernel Memory\n              \n              \n                  \n                      #rag\n                      #dotnet\n                      #llm\n                      #ai\n                  \n            \n          \n\n          \n              \n  \n    \n      \n        .NET AI / ML Highlights (2 Part Series)\n      \n    \n\n    \n\n          \n            1\n            Building a Digital Dungeon Master with Semantic Kernel, C#, and Azure\n          \n\n          \n            2\n            Document Search in .NET with Kernel Memory\n          \n    \n  \n\n            \n                I recently discovered the Kernel Memory library for document indexing, web scraping, semantic search, and LLM-based question answering. The capabilities, flexibility, and simplicity of this library are so fantastic that it\u0027s quickly ascended my list of favorite AI libraries to work with for RAG search, document search, or AI-based question answering.\n\n\n\n\n\nIn this article I\u0027ll walk you through what Kernel Memory is and how you can use the C# version of this library to quickly index, search, and chat with knowledge stored in documents or web pages.\n\n\n  \n  \n  Kernel Memory, a flexible document indexing and RAG search library\n\n\nAt its core, Kernel Memory is all about ingesting information in various sources, indexing it, storing it in a vector storage solution, and providing a means for searching and question answering with this indexed knowledge.\n\n\n\nWe\u0027ll walk through a full small application in this article, but here\u0027s a simple implementation to help orient you:\n\n\n\nIKernelMemory memory = new KernelMemoryBuilder()\n    .WithOpenAI(openAiConfig)\n    .Build();\n\nawait memory.ImportDocumentAsync(\u0022TheGuide.pdf\u0022);\n\nstring question = \u0022What is the answer to the question of life, the universe, and everything?\u0022\nMemoryAnswer answer = await memory.AskAsync(question);\n\nstring reply = answer.Result;\nconsole.WriteLine(reply);\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nIn this snippet we see that:\n\n\nKernel Memory uses a standard builder API allowing you to add in various sources that are relevant to you (here an OpenAI text and embedding model)\nKernel Memory provides Import methods allowing you to index documents, text, and web pages and store them in its current vector store\nKernel Memory provides a convenient way of asking questions to an LLM and providing your information as a RAG data source\n\n\nIn this short example we\u0027re using the default volatile memory vector store which is built into Kernel Memory for demonstration purposes, but you could just as easily use an existing vector storage provider such as Qdrant, Azure AI Search, Postgres, Redis, or others.\n\nLikewise, Kernel Memory supports a wide range of LLMs and other ingestion data sources including OpenAI, Anthropic, ONNX, and even locally-running Ollama models.\n\nThis last point has me particularly excited because I can now use locally hosted LLMs and on-network vector storage solutions to ingest and search documents without needing to worry about data leaving my network or per-usage cloud hosting costs. This opens up new usage scenarios for me for experimentation, workshops at conferences, and business scenarios.\n\nLet\u0027s drill into a larger Kernel Memory app and see how it flows.\n\n\n  \n  \n  Creating a Kernel Memory instance in C\n\n\nThrough the rest of this article we\u0027ll walk through a small C# console application from start to finish. This project is available on GitHub if you\u0027d like to clone it locally and experiment with it as well, though you\u0027ll need to provide your own API keys.\n\nNext we use some fairly ordinary C# code using the Microsoft.Extensions.Configuration mechanism for reading settings:\n\n\n\nIConfiguration config = new ConfigurationBuilder()\n    .AddJsonFile(\u0022appsettings.json\u0022, optional: true, reloadOnChange: false)\n    .AddEnvironmentVariables()\n    .AddUserSecrets\u0026lt;Program\u0026gt;()\n    .AddCommandLine(args)\n    .Build();\nDocSearchDemoSettings settings = config.Get\u0026lt;DocSearchDemoSettings\u0026gt;()!;\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThis reads information from a local JSON file, command-line arguments, user secrets, and environment variables and stores them into a settings object that looks like this:\n\n\n\npublic class DocSearchDemoSettings\n{\n    public required string OpenAIEndpoint { get; init; }\n    public required string OpenAIKey { get; init; }\n    public required string TextModelName { get; init; }\n    public required string EmbeddingModelName { get; init; }\n}\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nMost of these settings are set in the appsettings.json file, though you should store your endpoint and key in user secrets or environment variables if you plan on working with your own keys and managing things in source control.\n\n\n\n{\n    \u0022OpenAIEndpoint\u0022: \u0022YourEndpoint\u0022,\n    \u0022OpenAIKey\u0022: \u0022YourApiKey\u0022,\n    \u0022TextModelName\u0022: \u0022gpt-4o-mini\u0022,\n    \u0022EmbeddingModelName\u0022: \u0022text-embedding-3-small\u0022\n}\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nWith our configuration loaded, we now jump into creating our IKernelMemory instance, where we\u0027ll need to provide information on what model, endpoints and keys to use:\n\n\n\nOpenAIConfig openAiConfig = new()\n{\n    APIKey = settings.OpenAIKey,\n    Endpoint = settings.OpenAIEndpoint,\n    EmbeddingModel = settings.EmbeddingModelName,\n    TextModel = settings.TextModelName,\n};\nIKernelMemory memory = new KernelMemoryBuilder()\n    .WithOpenAI(openAiConfig)\n    .Build();\n\nIAnsiConsole console = AnsiConsole.Console;\nconsole.MarkupLine(\u0022[green]KernelMemory initialized.[/]\u0022);\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThis creates and configures our Kernel Memory instance using an OpenAI text and embeddings model. The text completion model will be used for conversations with our data using the AskAsync method while the embeddings model is used to generate a vector representing different chunks of documents that are indexed as well as the search queries when the memory instance is searched.\n\nBy default Kernel Memory is using a volatile in-memory vector store that gets completely discarded and recreated every time the application runs. This is not a production-level solution, but is fine for quick demonstrations on low volumes of data. For larger-scale scenarios or production usage you would use a dedicated vector storage solution and connect it to Kernel Memory when building your IKernelMemory instance.\n\nAlso note the use of AnsiConsole. This is part of Spectre.Console, a library I frequently use alongside .NET console apps for enhanced input and output capabilities. We\u0027ll see more of this later.\n\n\n  \n  \n  Indexing Documents and Web Scraping with Kernel Memory\n\n\nWith our Kernel Memory instance set up and running an empty vector store, we should ingest some data before we continue on.\n\nKernel Memory supports importing data in the following formats:\n\n\nRaw strings\nWeb pages via web scraping\nDocuments in a supported format (PDF, Images, Word, PowerPoint, Excel, Markdown, text files, and JSON)\n\n\nThe API for importing each of these sources is exceptionally simple as well:\n\n\n\n// Index documents and web content\nconsole.MarkupLine(\u0022[yellow]Importing documents...[/]\u0022);\n\nawait memory.ImportTextAsync(\u0022KernelMemory allows you to import web pages, documents, and text\u0022);\nawait memory.ImportTextAsync(\u0022KernelMemory supports PDF, md, txt, docx, pptx, xlsx, and other formats\u0022, \u0022Doc-Id\u0022);\n\nawait memory.ImportDocumentAsync(\u0022Facts.txt\u0022, \u0022Repository-Facts\u0022);\n\nawait memory.ImportWebPageAsync(\u0022https://LeadingEDJE.com\u0022, \u0022Leading-EDJE-Web-Page\u0022);\nawait memory.ImportWebPageAsync(\u0022https://microsoft.github.io/kernel-memory/\u0022,\n                                \u0022KernelMemory-Web-Page\u0022, \n                                new TagCollection { \u0022GitHub\u0022});\n\nconsole.MarkupLine(\u0022[green]Documents imported.[/]\u0022);\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThis code indexes a pair of raw strings, a Facts.txt file included with the repository, and a pair of web pages: Leading EDJE\u0027s web site (my employer, an IT services consultancy in Columbus, Ohio) and the GitHub repository for Kernel Memory.\n\nNote that as we index anything we can just give it a data source, or we could give it a data source and a document Id, or we could provide additional tag or index metadata as well.\n\nUsing tags and indexes you can annotate the documents you insert as belonging to certain collections. This allows you to filter down to certain groups of documents later on when searching or asking questions which supports critical scenarios such as restricting information available to different users based on which organization they\u0027re in or their security role.\n\nMost everything about Kernel Memory is customizable as well, so you can change how documents are decoded and partitioned and you can substitute in your own web scraping provider in lieu of Kernel Memory\u0027s default one, for example.\n\nThese Import calls will take a few seconds to complete, based on the size of the data, your text embeddings model, and your choice of vector storage solution. Once it completes, your data will be available for search.\n\n\n  \n  \n  Searching Documents with Kernel Memory and Text Embeddings\n\n\nWith our data ingested, we can now query Kernel Memory for specific questions. This can come in one of two ways:\n\n\n\nSearchAsync which provides raw search results to be handled programmatically\n\nAskAsync which performs a search and then has an LLM respond to the question asked given the search results.\n\n\nWhile the search results are more complex than the ask results, we should start by exploring search as this helps us understand what Kernel Memory is doing under the hood.\n\n\n\nThe code to conduct the search itself is straightforward and intuitive:\n\n\n\nstring search = console.Ask\u0026lt;string\u0026gt;(\u0022What do you want to search for?\u0022);\nconsole.MarkupLineInterpolated($\u0022[yellow]Searching for \u0027{search}\u0027...[/]\u0022);\n\nSearchResult results = await memory.SearchAsync(search);\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThe SearchResult object organizes its results into different citations representing different documents searched. Within each citation will be different sets of partitions which represent different chunks of the document which are indexed and stored for data retrieval. This is important because documents and web pages can be very long and you want to match only on the most relevant portions of a document when performing a search.\n\nEach partition has a relevance score stored as a decimal percentage value ranging from 0 to 1.\n\nUsing Spectre.Console, you can loop over these citations and partitions and create a display table using the following code:\n\n\n\nTable table = new Table()\n  .AddColumns(\u0022Document\u0022, \u0022Partition\u0022, \u0022Section\u0022, \u0022Score\u0022, \u0022Text\u0022);\n\nforeach (var citation in results.Results)\n{\n  foreach (var part in citation.Partitions)\n  {\n    string snippet = part.Text;\n    if (part.Text.Length \u0026gt; 100)\n    {\n      snippet = part.Text[..100] \u002B \u0022...\u0022;\n    }\n\n    table.AddRow(citation.DocumentId, part.PartitionNumber.ToString(), part.SectionNumber.ToString(), part.Relevance.ToString(\u0022P2\u0022), snippet);\n  }\n}\n\ntable.Expand();\nconsole.Write(table);\nconsole. WriteLine();\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThis produces a formatted table resembling the following image:\n\n\n\nAs you can see, each match will have a document, partition, section within that partition, relevance score, and some associated text. Individual tags and source URLs will also be available. Note how document names are not mandatory, but Kernel Memory generates its own random Ids if you don\u0027t provide an id yourself.\n\nYou can use SearchAsync to manually identify the most relevant documents and pieces of documents from your vector store. This can be useful for providing semantic search capabilities across your site, or for identifying text to inject into prompts as a form of Retrieval Augmetnation Generation (RAG). However, if you\u0027re working with RAG, there\u0027s a chance you might be better off using the AskAsync method instead, as we\u0027ll see next.\n\n\n  \n  \n  Question answering with KernelMemory and LLM\n\n\nIf your end goal is to provide a reply to the user from a query they sent you, you should consider using Kernel Memory\u0027s AskAsync method.\n\nAskAsync uses the text model to summarize the result of a search and provide that string back to the user.\n\n\n\nThe code for this is extremely straightforward:\n\n\n\nstring question = console.Ask\u0026lt;string\u0026gt;(\u0022What do you want to ask?\u0022);\nconsole.MarkupLineInterpolated($\u0022[yellow]Asking \u0027{question}\u0027...[/]\u0022);\n\nMemoryAnswer answer = await memory.AskAsync(question);\n\nconsole.WriteLine(answer.Result);\n\n\n\n    Enter fullscreen mode\n    \n\n\n    Exit fullscreen mode\n    \n\n\n\n\n\n\n\n\nThis provides a text output from your LLM as you would expect:\n\n\n\nAs you might imagine, the AskAsync method takes significantly longer than SearchAsync because it effectively is performing the search as a RAG search and then using the results to chat with the underlying LLM.\n\nIf you need information about the sources cited, those are also available in the MemoryAnswer, which can be helpful for diagnostic / logging purposes or simply to let the user know what was used in answering their question - or giving them additional links to investigate.\n\n\n  \n  \n  Kernel Memory Extensions and Integrations\n\n\nKernel Memory is a very powerful and flexible library with a simple API and good behaviors out of the box. It has a high degree of customizability in terms of those default behaviors for the times when you need additional control.\n\nFor example, you can customize the prompts Kernel Memory uses for fact extraction and summarization, giving you more control of its behavior as a chat partner.\n\nAdditionally, Kernel Memory has a number of different deployment models, ranging from in-process MemoryServerless implementations like the one described in this article to pre-built Docker containers, to web services.\n\nKernel Memory was also built with Semantic Kernel at least partially in mind. While Semantic Kernel has its own built-in vector store capabilities, they\u0027re harder to use than Kernel Memory\u0027s options and don\u0027t have as many ingestion options. As a result, you can connect Kernel Memory into a Semantic Kernel instance, providing a RAG data source for your AI orchestration solution. In fact, there\u0027s even a pre-built SemanticKernelPlugin NuGet package built just for this purpose.\n\n\n  \n  \n  Conclusion\n\n\nI\u0027m absolutely enamored with the Kernel Memory library and see a lot of uses for this technology including:\n\n\nSimple RAG search and question answering for web applications\nIndexing existing knowledge sources like Confluence or Obsidian vaults\nProviding a cost-effective and secure option for document ingestion, ensuring document data never leaves the network\n\n\nIf you\u0027re curious about Kernel Memory, I\u0027d encourage you to take a look at the GitHub Repository containing this article\u0027s code and try things yourself.\n\nI\u0027ll be writing more about Kernel Memory in a chapter in my next technical book which releases in Q3 2025, and I\u0027m looking at revising my Digital Dungeon Master solution to take advantage of the Kernel Memory / Semantic Kernel integration. I can also see some very real ways where Kernel Memory can help offer some of Leading EDJE\u0027s current and prospective clients additional value, capabilities, and cost savings so I\u0027m excited to share this technology with the broader technical community.\n\nIt\u0027s a great time to be doing AI and ML in .NET and I\u0027m elated to have Kernel Memory as a tool in my toolbox.\n\n\n            \n\n              \n  \n    \n      \n        .NET AI / ML Highlights (2 Part Series)\n      \n    \n\n    \n\n          \n            1\n            Building a Digital Dungeon Master with Semantic Kernel, C#, and Azure\n          \n\n          \n            2\n            Document Search in .NET with Kernel Memory\n          \n    \n  \n\n              \n          \n          \n    \n      \n        \n          Top comments (1)\n        \n      \n\n\n      \n        \n          Subscribe\n        \n      \n    \n    \n    \n\n        \n\n\n\n\n  \n\n    \n    \n    \n\n  \n    \n  \n  \n    \n      \n\n\n    \n\n    \n      \n        Personal\n        Trusted User\n      \n\n      \n      \n      \n      \n\n      \n        Create template\n      \n      Templates let you quickly answer FAQs or store snippets for re-use.\n    \n\n    \n\n    \n      Submit\n      Preview\n      Dismiss\n    \n  \n\n  \n\n\n\n      \n              \n      \n        \n          Collapse\n    \n\n\n          Expand\n    \n\n\n        \n        \n      \n  \n    \u0026nbsp;\n    \n\n    \n    \n  \n\n\n  \n    \n        \n\n\n        \n  \n    \n      Sarah Matta\n    \n  \n  \n    \n      Sarah Matta\n      \n    \n    \n    \n        \n  \n    \n      \n    \n    \n      Sarah Matta\n      \n    \n  \n\n\n\n  Follow\n\n  \n    Thinking beyond the obvious, solving beyond the expected. Software engineer passionate about impactful problem-solving and making technology work better for people.\n  \n\n  \n    \n        \n          \n            Location\n          \n          \n            Georgia, USA\n          \n        \n      \n        \n          Joined\n        \n        \n          Nov 4, 2024\n        \n      \n    \n  \n\n    \n\n\n\n  \n\n  \u0026bull;\n\n\n  \n    May 29\n  \n\n\n\n\n  \n    \n      Dropdown menu\n    \n\n\n    \n    \n      \n        Copy link\n        \n          \n              \n                Hide\n              \n          \n        \n        \n        \n      \n    \n  \n\n\n\n        \n          This is very cool, I\u0027m adding it to my side quest list.\n\n\n        \n\n    \n\n    \n\n    \n  \n    Like comment: \n\n    Like comment: \n    \n\n\n    2\u0026nbsp;likes\n    \n      Like\n    \n  \n\n      \n        Comment button\n\n        Reply\n      \n\n\n\n  \n\n\n\n  \n    \n\n\n      \n    \n\n    \n\n\n  \n  Code of Conduct\n  \u0026bull;\n  Report abuse\n\n\n\n\n\n\n  \n    \n      \n        Are you sure you want to hide this comment? It will become hidden in your post, but will still be visible via the comment\u0027s permalink.\n      \n      \n        \n        Hide child comments as well\n      \n      \n        \n          Confirm\n        \n      \n    \n  For further actions, you may consider blocking this person and/or reporting abuse\n\n\n\n\n        \n\n        \n          \n        \n\n          \n      \n    \n\n    \n      \n  \n    \n  \n    \n      \n    \n    \n      Leading EDJE\n      \n    \n  \n\n\n\n  Follow\n\n  \n    How far can we go?\n  \n\n  \n    Seeking cutting-edge insights? Leading EDJE develops bespoke technology solutions that help transform our partners and their business. Explore our approach to crafting strategic solutions that create positive disruption to drive business growth.\n\n  \n    \n      \n        Explore Leading EDJE\n      \n    \n\n  \n\n      \n        \n          \n            More from Leading EDJE\n          \n        \n        \n            \n              Tracking AI system performance using AI Evaluation Reports\n              \n                  #ai\n                  #csharp\n                  #testing\n                  #llm\n              \n            \n            \n              Add Structured Testing to Your AI Vibe - with promptfoo\n              \n                  #ai\n                  #promptengineering\n                  #testing\n                  #devops\n              \n            \n            \n              Automate the Testing of Your LLM Prompts\n              \n                  #ai\n                  #promptengineering\n                  #testing\n                  #testdev\n              \n            \n        \n      \n\n\n\n\n    \n  \n\n  \n  \n\n  \n  \n\n\n\n  \n  \n\n\n    \n    \n  \n\n    \n\n\n  \n\n\n        \n\n  \n          \n        \n            💎 DEV Diamond Sponsors\n        \n        \n            Thank you to our Diamond Sponsors for supporting the DEV Community\n        \n    \n        \n            \n                \n                    \n                \n                Google AI is the official AI Model and Platform Partner of DEV\n            \n\n            \n                \n                    \n                \n                Neon is the official database partner of DEV\n            \n    \n            \n                \n                    \n                \n                Algolia is the official search partner of DEV\n            \n        \n    \n  \n\n\n    \n      DEV Community — A space to discuss and keep up software development and manage your software career\n    \n\n    \n        \n    \n      Home\n    \n    \n  \n  \n    \n      About\n    \n    \n  \n  \n    \n      Contact\n    \n    \n  \n\n    \n\n    \n        \n    \n      Code of Conduct\n    \n    \n  \n  \n    \n      Privacy Policy\n    \n    \n  \n  \n    \n      Terms of Use\n    \n    \n  \n\n    \n\n    \n      Built on Forem — the open source software that powers DEV and other inclusive communities.\n      Made with love and Ruby on Rails. DEV Community \u0026copy; 2016 - 2025.\n    \n  \n\n\n\n    \n  \n    \n      \n    \n    \n      \n          We\u0026#39;re a place where coders share, stay up-to-date and grow their careers.\n      \n    \n    \n      \n        Log in\n      \n      \n        Create account","metadata":{"completeSentences":"true"}}],"mimeType":"text/plain"}