[
  {
    "Index": 0,
    "Content": "SECTION 1: الضمان (WARRANTY \u0026 COVERAGE)الضمان القياسي يغطي جميع عيوب التصنيع لمدة سنة واحدة (12 شهر) من تاريخ الشراء. لا يغطي الضمان الأضرار الناجمة عن سوء الاستخدام، بما في ذلك الأضرار المادية الناتجة عن السقوط أو التعرض للرطوبة. يمكن تمديد فترة الضمان إلى سنتين مقابل رسوم إضافية يتم دفعها في غضون 30 يوماً من الشراء. يجب على العميل تقديم فاتورة الشراء الأصلية للمطالبة بالضمان.SECTION 2: سياسة الإلغاء ورسومها (CANCELLATION POLICY)يمكن إلغاء الطلبات أو الاشتراكات خلال 48 ساعة من تاريخ العملية دون أي رسوم إضافية. إذا تم الإلغاء بعد مرور 48 ساعة وقبل تسليم المنتج، يتم تطبيق رسوم إدارية قدرها 10% من إجمالي القيمة. بعد تسليم المنتج ومرور 7 أيام، يصبح الإلغاء غير ممكن.SECTION 3: تفاصيل الدعم الفني (TECHNICAL SUPPORT)يتم توفير الدعم الفني على مدار الساعة (24/7) عبر البريد الإلكتروني والهاتف. متوسط زمن الاستجابة الأولي للدعم الفني هو 4 ساعات للمشاكل متوسطة الأهمية.",
    "Source": "arabic.docx",
    "Page": null,
    "Vector": null
  },
  {
    "Index": 1,
    "Content": "الإلكتروني والهاتف. متوسط زمن الاستجابة الأولي للدعم الفني هو 4 ساعات للمشاكل متوسطة الأهمية. يتم التعامل مع مشاكل الخوادم والأمان (Critical Issues) بأولوية قصوى وضمن زمن استجابة لا يتجاوز 30 دقيقة.(تكرار متعمد للمحتوى لزيادة طول المستند وتحدي الـ Chunking)SECTION 4: (FILLER CONTENT - لاختبار التقسيم)نص طويل لاختبار أداة التقسيم التسلسلي: يتم التعامل مع كل طلب بشكل منفصل لضمان أعلى مستويات الجودة. يتكون فريق العمل لدينا من خبراء في مجالاتهم، ولديهم خبرة واسعة في إدارة المشاريع المعقدة. تتم جميع عمليات التقييم الفنية قبل أي نشر للإنتاج، وهذا يضمن ثبات النظام.SECTION 5: (FILLER CONTENT - لاختبار التقسيم)التسلسل الزمني للعمليات يتبع بدقة منهجية Agile لضمان المرونة والاستجابة السريعة لتغييرات العميل. تتم المراجعات الأسبوعية لجميع المهام الجارية، ويتم إخطار العميل بأي تأخير محتمل مسبقاً.SECTION 6: ضمان إضافي وتغطية الأضرار (WARRANTY - DEEP DIVE)للتأكيد على سياستنا: لا تغطي التغطية القياسية الأضرار المادية الناتجة عن سوء الاستخدام أو الحوادث، بما في ذلك السوائل أو الحرارة الزائدة.",
    "Source": "arabic.docx",
    "Page": null,
    "Vector": null
  },
  {
    "Index": 2,
    "Content": "الأضرار المادية الناتجة عن سوء الاستخدام أو الحوادث، بما في ذلك السوائل أو الحرارة الزائدة. يمكن للعميل شراء خطة حماية إضافية ضد الحوادث (Accidental Damage Plan) في أي وقت قبل انتهاء فترة الضمان الأساسية. المطالبات يجب أن تتم خلال 60 يوماً من اكتشاف العيب. (تكرار للمعلومة، مع إضافة تفصيل جديد).SECTION 7: رسوم المعالجة والتعديل (CANCELLATION FEES)سيتم تطبيق رسوم معالجة (Processing Fee) تعادل 10% من القيمة الإجمالية إذا تم الإلغاء بعد انقضاء 48 ساعة من الدفع. إذا كان المنتج قد تم شحنه بالفعل، فإن رسوم الإلغاء ترتفع إلى 20%. نرجو الانتباه إلى أن هذه الرسوم غير قابلة للتفاوض وتطبق تلقائياً عند طلب الإلغاء. (تكرار للمعلومة، مع تغيير في نسبة الرسوم في حالة الشحن).",
    "Source": "arabic.docx",
    "Page": null,
    "Vector": null
  }
]