[
  {
    "Index": 0,
    "Content": "Customer Support Knowledge Base – Sample RAG DocumentThis Word file is a small sample knowledge base that you can use to test Retrieval-Augmented Generation (RAG). It contains multiple sections, FAQs, and structured information so you can try chunking, embedding, and querying.1. Product OverviewOur product, AI Housing Assistant, is an AI-powered web application designed to help property managers and tenants manage housing requests, maintenance tickets, and communication. The assistant can answer common questions, guide users through processes, and summarize housing policies.Key capabilities include:- Answering FAQs about rent, maintenance, and contracts.- Guiding tenants to submit maintenance requests correctly.- Providing step-by-step instructions for moving in or moving out.- Summarizing long policy documents into short, user-friendly answers.2. Housing Policies (Summary)Tenants are required to pay rent on or before the 5th day of each month.",
    "Source": "RAG_Sample_Knowledge_Document.docx",
    "Page": null
  },
  {
    "Index": 1,
    "Content": "Housing Policies (Summary)Tenants are required to pay rent on or before the 5th day of each month. Late payments may incur a fee after a grace period of three days. Maintenance requests should be submitted through the online portal and must include a short description, photos if possible, and preferred access times.Emergency maintenance (such as gas leaks, electrical hazards, or flooding) should be reported immediately using the emergency hotline. Non-emergency issues, like minor plumbing problems or cosmetic damage, are usually handled within 3–5 business days.3. Frequently Asked Questions (FAQ)Q1: How do I submit a maintenance request?A: Log in to the AI Housing Assistant portal, go to “Maintenance”, click “New Request”, and fill in the required fields (category, description, photos, and preferred time). Then click “Submit”. You will receive a confirmation message and a ticket number.Q2: How long does it take to resolve a maintenance issue?A: For non-emergency issues, the target resolution time is 3–5 business days.",
    "Source": "RAG_Sample_Knowledge_Document.docx",
    "Page": null
  },
  {
    "Index": 2,
    "Content": "a maintenance issue?A: For non-emergency issues, the target resolution time is 3–5 business days. Emergency issues are prioritized and handled as soon as possible, typically within the same day.Q3: Can I reschedule a maintenance visit?A: Yes, you can reschedule by opening your existing maintenance ticket in the portal and selecting a new preferred date and time. The system will notify the assigned technician of the change.Q4: How do I request to move out?A: Go to the “Move-Out Requests” section in the portal, fill in your intended move-out date, reason for leaving, and forwarding contact information. You will receive a checklist of tasks to complete before your final inspection.Q5: Does the AI assistant see my personal data?A: The AI assistant only accesses the minimum data required to answer your question or perform an action. All data is processed according to the organization’s privacy and security policies.4.",
    "Source": "RAG_Sample_Knowledge_Document.docx",
    "Page": null
  },
  {
    "Index": 3,
    "Content": "an action. All data is processed according to the organization’s privacy and security policies.4. Example Queries for RAG TestingYou can use the following example queries to test your RAG pipeline against this document:What is the deadline for paying rent each month?How do I submit a new maintenance request?What is the policy for emergency maintenance?How long does it usually take to fix non-emergency issues?Can the AI assistant see all of my personal data?When you run RAG, the system should retrieve the relevant parts of this document and generate accurate, concise answers based on them.",
    "Source": "RAG_Sample_Knowledge_Document.docx",
    "Page": null
  }
]